import pandas as pd
import re
# Load data
data = pd.read_json('annamayya_dataset.json')


# Define a function to scan through Ragas
def iste(line):
    for c in line:
        if 'ఀ' <= c <= '౿':
            continue
        if c in [' ', ',']:
            continue
        return False
    return True


def get_non_te_entries(col,data):
    lang_chk = [iste(x) for x in data[col].unique()]
    lst = data[col].unique()
    non_te_entries = [lst[x] for x in range(len(lst)) if not lang_chk[x]]
    return non_te_entries


# The Ragas '??????', '??' do not have any use. We will drop these entries.
data.drop(data[data.Ragam == '??????'].index, axis=0, inplace=True)
data.drop(data[data.Ragam == '??'].index, axis=0, inplace=True)
data.drop(data[data.Ragam == '--'].index, axis=0, inplace=True)

# Fill missing values with empty strings.
data.fillna('', inplace=True)

# Cleanup Pallavi and Charanam columns before creating Lyric.
data['Pallavi'] = data['Pallavi'].apply(lambda x: x.replace('॥పల్లవి॥', ' '))
for n in range(1, 16):
    data[f'Charanam{n}'] = data[f'Charanam{n}'].apply(lambda x: x.replace(f'చ. {n}:',''))


def make_full_lyric(s, cols):
    t = s['Pallavi']
    for n in range(1, 16): t = t + '\r\n' + s[f'Charanam{n}']
    return t.strip()


data['Lyric'] = data.apply(lambda x: make_full_lyric(x, data.columns), axis=1)


reg_exprs = [
    re.compile(r'\d:'),
    re.compile(r'\(.*\)'),
    re.compile(r'\d')
]
def clean_lyric(s,reg_exprs):
    for r in reg_exprs:
        s = r.sub('',s)
    replace_list = {
        '\r' : '', # Remove all "\r"
        '_\n' : '', '-\n' : '', '–\n' : '', '–\n' : '', '—\n' : '', '-\n' : '', # A "-" at end of sentence means continuation of word
        '_' : '', '-' : '', '–' : '', '–' : '', '—' : '', '-' : '', # "-" at remaining places can be simply replaced.
        'ఁ' : '', 'ఽ' : '', # This is an obsolete character and will be removed
        '\u200c' : '', '\uf18f' : '', '\uf18d' : '', '\uf190' : '',
        '।' : ' ', '|' : ' ', '!' : ' ', '?' : ' ', '॥' : '', ';' : '',',' : ' ',
        '.' : '','’' : '', "'" : '', '"' : '', '“' : '', '”' : '', '‘' : ' ', '`' : ' ', '`' : ' ', # Replace Quotes
        '(' : '', ')' : '',
        '0' : 'ం', ':' : 'ః', 't'  : 'ూ', # Typos
        '\t' : ' ',
        '  ' : ' ', # Reduce number of spaces.
        '\n' : ' '
    }
    for k in replace_list: s = s.replace(k,replace_list[k])
    return s


data['Lyric'] = data['Lyric'].apply(lambda x:clean_lyric(x, reg_exprs))

data.genre.replace({'ఆధ్యాత్మ':'Devotional','శృంగార':'Romantic'},inplace=True)


map_tbl = {'రామక్రియ – అటతాళం' : 'రామక్రియ',
           'శంకరా‘రణం' : "శంకరాభరణం",
           'నాదరామక్రి.య' : 'నాదరామక్రియ',
           'చా(ఛా?)యానాట' : "చాయానాట",
           'సౌరా+పం': "సౌరాపం",
           'రేవగుప్తి – అటతాళం':  "రేవగుప్తి",
           'కేతా (దా?) రగౌళ' : "కేదారగౌళ",
           'పళవంజరి (రం?)': "ఫలమంజరి",
           'కాంభో(బో?)ది': "కాంబోది",
           'గుమ్మకాంభో(బో?)ది' : "గుమ్మకాంబోది",
           'తెలుగుగా(గాం?)బోది' : "తెలుగుగాంబోది",
           'మంగళకౌశి\u200cక' : 'మంగళకౌశిక',
           'లలిత (అవతారాలు )' : "లలిత",
           'దేశా(సా)క్షి' : 'దేసాక్షి',
           'లలిత (అంత్య ప్రాస)': "లలిత",
           'నాదరామక్రియ (అంత్యప్రాస)': 'నాదరామక్రియ',
           'దేసాక్షి (అంత్యప్రాస)' : 'దేసాక్షి',
           'పాడి (అంత్యప్రాస)' : 'పాడి',
           'లలిత (సంస్కృతం)' : 'లలిత',
           'లలిత (అంత్యప్రాస)' : "లలిత",
           '(జక్కిణి) బౌళి' : 'బౌళి',
           'ఙ\u200cఆహిరి' : 'ఆహిరి',
           'మంగళకౌశి (క)' : 'మంగళకౌశిక',
           'తెలుఁగుఁ గాంభో(బో)ది' : "తెలుగుగాంబోది",
           'కురఁ(రం)జి' : "కురంజి",
           'భైరవి-రచ్చెతాళం' : 'భైరవి',
           'బౌళి-జంపెతాళం' : "బౌళి",
           'శుద్ధవసంతం -రచ్చెతాళం' : "శుద్ధవసంతం",
           'కాంబోది-రచ్చతాళం' : "కాంబోది",
           'కన్నడగౌళ-అటతాళం' : "కన్నడగౌళ",
           'ముఖారి-ఆటతాళం' : "ముఖారి",
           'ముఖారి-అటతాళం' : "ముఖారి",
           'శ్రీరాగం-రచ్చెతాళం' : "శ్రీరాగం",
           'సావేరి-జంపె' : "సావేరి",
           'దేశాక్షి-యెకతాళి' : 'దేసాక్షి-ఏకతాళి',
           'బౌళి-వర్మతాళం' : "బౌళి"}

data.Ragam.replace(map_tbl,inplace=True)

# There are several typos and variations
typo_tbl = {
    'అందోళి': 'ఆందోళి',
    'అరిభి': 'ఆరిభి',
    'ఆరిబి': 'ఆరిభి',
    'ఆరబి': 'ఆరిభి',
    'ఆరభి': 'ఆరిభి',
    'అమర సింధు': 'అమరసింధు',
    'అమరసిందు': 'అమరసింధు',
    'కన్నడ గౌళ' : 'కన్నడగౌళ',
    'భైరెవి': 'భైరవి',
    'కాంబోధి': 'కాంబోది',
    'కాంబొది': 'కాంబోది',
    'కాంబోతి': 'కాంబోది',
    'కాంబోథి': 'కాంబోది',
    'ధన్నాశి' : 'ధన్నాసి',
    'దన్నాశి' : 'ధన్నాసి',
    'ఆహరి': 'ఆహిరి',
    'అహిరి': 'ఆహిరి',
    'ఆహిరీ': 'ఆహిరి',
    'ఆహారి':'ఆహిరి',
    'ఆహిరీనాట': 'ఆహిరి నాట',
    'ఆహారినాట': 'ఆహిరి నాట',
    'ఆహిరానాట': 'ఆహిరి నాట',
    'ఆహిరినాట': 'ఆహిరి నాట',
    'శంకరాభారణం': 'శంకరాభరణం',
    'శంకారాభరణం': 'శంకరాభరణం',
    'శంకరభారణం': 'శంకరాభరణం',
    'శంకరాభ రణం': 'శంకరాభరణం',
    'శంకరాభరణము' : 'శంకరాభరణం',
    'శకంరాభరణం' : 'శంకరాభరణం',
    'శంకరభరణం': 'శంకరాభరణం',
    'శంఖారాభరణం': 'శంకరాభరణం',
    'శంకదాభరణం':  'శంకరాభరణం',
    'శంకారభరణం': 'శంకరాభరణం',
    'హిందొళ వసంతం' : 'హిందోళవసంతం',
    'హిందోళవసంతము' : 'హిందోళవసంతం',
    'హిందొళవసంతం' : 'హిందోళవసంతం',
    'హిందోళ వసంతం' : 'హిందోళవసంతం',
    'హిందొళవంతం':  'హిందోళవసంతం',
    'హిందోలవసంతం': 'హిందోళవసంతం',
    'దేవగాందారి': 'దేవగాంధారి',
    'ఛాయనాట': 'చాయానాట',
    'ఛాయానాట': 'చాయానాట',
    'చాయనాట': 'చాయానాట',
    'మాళవి గౌళ' : 'మాళవిగౌళ',
    'భవుళి': "బౌళి",
    'భ వుళి' : "బౌళి",
    'భౌళి' : "బౌళి",
    'భూవుళి': "బౌళి",
    'బౌలి' :  "బౌళి",
    'బేళి' :  "బౌళి",
    'బౌళ':   "బౌళి",
    'ఙభౌళి':  "బౌళి",
    'దేశాక్షి' : 'దేసాక్షి',
    'కాంభోది': 'కాంబోది',
    'కాంబోజి' : 'కాంబోది',
    'కాంబోది చిఅ' : 'కాంబోది',
    'కాంభోజి': 'కాంబోది',
    'కుంతల వరాళి': 'కుంతలవరాళి',
    'కుంతలవరాశి': 'కుంతలవరాళి',
    'కుంతళవరాళి': 'కుంతలవరాళి',
    'దేశి':'దేసి',
    'శుద్ధవంతం':'శుద్దవసంతం',
    'శుద్దవంతం':'శుద్దవసంతం',
    'శుద్దవంసంతం': 'శుద్దవసంతం',
    'శుద్దవసంతము':'శుద్దవసంతం',
    'శుధ్ధవసంతం': 'శుద్దవసంతం',
    'శుద్ధ వసంతం': 'శుద్దవసంతం',
    'శద్ధవసంతం' :  'శుద్దవసంతం',
    'తెలుఁగుఁగాఁబోది' :'తెలుగు కాంబోది',
    'తెలుగుగాంబోది' : 'తెలుగు కాంబోది',
    'తెలుఁగుఁగాంబోది':'తెలుగు కాంబోది',
    'తెలుఁగుకాంబోది':'తెలుగు కాంబోది',
    'తెలుగు కాంభోధి': 'తెలుగు కాంబోది',
    'తెలుఁగు కాంబోది' : 'తెలుగు కాంబోది',
    'తెలుఁగుగాంబోది': 'తెలుగు కాంబోది',
    'తెలుఁగు కాంభోధి': 'తెలుగు కాంబోది',
    'తెలుఁగుఁ కాంభోధి': 'తెలుగు కాంబోది',
    'తెలుఁగుఁగాంభోధి': 'తెలుగు కాంబోది',
    'తెలుఁగుఁ గాంబోది': 'తెలుగు కాంబోది',
    'తెలుగు గాంబోది':  'తెలుగు కాంబోది',
    'తెలుఁగుఁ గాఁబోది': 'తెలుగు కాంబోది',
    'తెలుఁగుకాంభోది':  'తెలుగు కాంబోది',
    'తెతుగు గాంబోది': 'తెలుగు కాంబోది',
    'తెలుగుగాంబొది': 'తెలుగు కాంబోది',
    'తెఁలుగుఁగాంబోది': 'తెలుగు కాంబోది',
    'తెలుగుగాబోది': 'తెలుగు కాంబోది',
    'తలుఁగుఁగాంబోది': 'తెలుగు కాంబోది',
    'తోలుఁగుగాంబోది': 'తెలుగు కాంబోది',
    'పళమంజరి':"ఫలమంజరి",
    'పళపంజరం':"ఫలమంజరి",
    'పళవంజరం' : "ఫలమంజరి",
    'పళవంజరి' : "ఫలమంజరి",
    'పడ పంజరము': "ఫలమంజరి",
    'పడవంజరం': "ఫలమంజరి",
    'పలవంజరం' : "ఫలమంజరి",
    'పళ పంజరం': "ఫలమంజరి",
    'రామక్రయ': 'రామక్రియ',
    'నాదనామక్రియ':'నాదరామక్రియ',
    'నాదరామ క్రియ':'నాదరామక్రియ',
    'నాదారామక్రియ':'నాదరామక్రియ',
    'నాదరమక్రియ': 'నాదరామక్రియ',
    'నాదరామక్రయ': 'నాదరామక్రియ',
    'నాదమక్రియ': 'నాదరామక్రియ',
    'నాదరామ్రకియ':  'నాదరామక్రియ',
    'శుద్దదేశి' : 'శుద్ధదేశి',
    'శుద్ద దేశి': 'శుద్ధదేశి',
    'శుద్ధ దేశి': 'శుద్ధదేశి',
    'హిజ్జిజ్జి' : 'హిజ్జిజి',
    'హిజ్జజి':'హిజ్జిజి',
    'హిజ్జెజి': 'హిజ్జిజి',
    'హిజ్జిజీ': 'హిజ్జిజి',
    'మెంచభౌళి':'మేఁచభౌళి',
    'మెంచబౌళి':'మేఁచభౌళి',
    'మెఁచభౌళి': 'మేఁచభౌళి',
    'మేసబౌళి': 'మేఁచభౌళి',
    'మేచఁబౌళి': 'మేఁచభౌళి',
    'మేఁచభవుళి': 'మేఁచభౌళి',
    'మేచభవుళి': 'మేఁచభౌళి',
    'మేఁచబౌళి' : 'మేఁచభౌళి',
    'మేఁచబౌళ': 'మేఁచభౌళి',
    'మేచ బౌళి' : 'మేఁచభౌళి',
    'మేచబౌళి' : 'మేఁచభౌళి',
    'సౌరాష్టం':'సౌరాష్ట్రం',
    'సౌరాష్ణం': 'సౌరాష్ట్రం',
    'సౌరాష్త్రం': 'సౌరాష్ట్రం',
    'సారాష్ట్రం': 'సౌరాష్ట్రం',
    'సౌరాష్ర్టం': 'సౌరాష్ట్రం',
    'సారాష్ణం': 'సౌరాష్ట్రం',
    'సౌరాప్ట్రం': 'సౌరాష్ట్రం',
    'సౌరాష్ణ్రం': 'సౌరాష్ట్రం',
    'సౌరాపం': 'సౌరాష్ట్రం',
    'బౌళరామక్రియ': 'బౌళిరామక్రియ',
    'బౌళరామక్రియ': 'బౌళిరామక్రియ',
    'బొళిరామక్రియ': 'బౌళిరామక్రియ',
    'భవుళిరామక్రియ': 'బౌళిరామక్రియ',
    'భౌళిరామక్రియ' : 'బౌళిరామక్రియ',
    'బౌళిరామక్రాయ': 'బౌళిరామక్రియ',
    'బౌళి రామక్రియ' : 'బౌళిరామక్రియ',
    'భోళిరామక్రియ' :  'బౌళిరామక్రియ',
    'బౌళి రామ క్రియ': 'బౌళిరామక్రియ',
    'బౌళి రామక్రియ': 'బౌళిరామక్రియ',
    'భౌళి రామక్రియ': 'బౌళిరామక్రియ',
    'మంగళకౌసిక' : 'మంగళకౌశిక',
    'మంగళ కౌశిక': 'మంగళకౌశిక',
    'మంగళకౌళిక': 'మంగళకౌశిక',
    'మంగళాకౌసిక': 'మంగళకౌశిక',
    'మంగళ కౌసిక' : 'మంగళకౌశిక',
    'మంగళి కౌశిక': 'మంగళకౌశిక',
    'మధ్యవవతి': 'మద్యమావతి',
    'మద్యవవతి': 'మద్యమావతి',
    'మధ్కమావతి': 'మద్యమావతి',
    'మధ్యమావతి' : 'మద్యమావతి',
    'మధ్యమావళి' : 'మద్యమావతి',
    'ప్రతాప నాట' : 'ప్రతాపనాట',
    'కేరారగౌళ' : 'కేదారగౌళ',
    'కేదార గౌళ': 'కేదారగౌళ',
    'కదారగౌళ':  'కేదారగౌళ',
    'ద్రావిళభైరవి': 'ద్రావిడభైరవి',
    'ద్రావిళబైరవి' : 'ద్రావిడభైరవి',
    'ద్రావిళ భైరవి': 'ద్రావిడభైరవి',
    'సింధు రామక్రియ' : 'సింధురామక్రియ',
    'సిందురామక్రియ' : 'సింధురామక్రియ',
    'సింధూరామక్రియ': 'సింధురామక్రియ',
    'సిందూరామక్రియ' : 'సింధురామక్రియ',
    'దేవగాంధరి' : 'దేవగాంధారి',
    'దేవగాంధిరి':  'దేవగాంధారి',
    'దేవ గాంధారం': 'దేవగాంధారి',
    'మావళవిగౌళ' : 'మాళవిగౌళి',
    'నారయణి' : 'నారాయణి',
    'హిందళం': 'హిందోళం',
    'హిందొళం':'హిందోళం',
    'నాగాంధారి' : 'నాగగాంధారి',
    'నాగగాందాఁరి': 'నాగగాంధారి',
    'నాగ గాంధారి': 'నాగగాంధారి',
    'నానాగవరాళి': 'నాగవరాళి',
    'నాగావరాళి': 'నాగవరాళి',
    'నాగవరళి':  'నాగవరాళి',
    'నాగవళి':   'నాగవరాళి',
    'నాగవరాశి':  'నాగవరాళి',
    'నాగ వరాళి':'నాగవరాళి',
    'శోకవరరాళి': 'శోకవరాళి',
    'శొకవరాళి':  'శోకవరాళి',
    'సాళంగవాట' : 'సాళంగనాట',
    'సాళంగనాఁట': 'సాళంగనాట',
    'సాళఁగనాట':  'సాళంగనాట',
    'సాళింగనాట': 'సాళంగనాఁట',
    'సాళంగ నాట': 'సాళంగనాఁట',
    'నట్టనారాయణి': 'నట్టినారాయణి',
    'వేళావతి': 'వేళావళి',
    'వేళావాళి': 'వేళావళి',
    'కేతారగౌళ':  'కేదారగౌళ',
    'కొండ మలహరి':  'కొండమలహరి',
    'కొండమలరి': 'కొండమలహరి',
    'గంభీర నాట' : 'గంభీరనాట',
    'ద్రావిడ భైరవి': 'ద్రావిడభైరవి',
    'దేవ గాంధారి': 'దేవగాంధారి',
    'పూర్వ గౌళ': 'పూర్వగౌళ',
    'దేశాళం' :  'దేసాళం',
    'దేసాళ':  'దేసాళం',
    'దాసాళం': 'దేసాళం',
    'ధన్యాశి': 'ధన్నాసి',
    'మాళవ శ్రీ': 'మాళవశ్రీ',
    'వరాలి' : 'వరాళి',
    'భైరలి' : 'భైరవి',
    'భైరవి': 'భైరవి',
    'బలంహంస':  'బళహంస',
    'బలహంస': 'బళహంస',
    'శ్రీ రాగం': 'శ్రీరాగం',
    'సామంత' : 'సామంతం',
    'సామంతము': 'సామంతం',
    'సాయంతం':  'సామంతం',
    'వరళి' : 'వరాళి',
    'వరాఙళి' : 'వరాళి',
    'వరాలి': 'వరాళి',
    'వరాశి' : 'వరాళి',
    'పూరిబి' : 'పూరిభి',
    'నారాయణ దేశాక్షి':  'నారాయణదేసాక్షి',
    'ముఖారి, ఏకతాళి': 'ముఖారి-ఏకతాళి',
    'శ్రీరాగం, యేకతాళి': 'శ్రీరాగం-ఏకతాళి',
    'గుండక్రియ': 'గుండుక్రియ',
    'గుజరి' : 'గుజ్జరి',
    'భూపాళం' : 'భూపాలం' ,
    'భూసాళం': 'భూపాలం',
    'రీతి గౌళ' : 'రీతిగౌళ',
    'హిందోళవంతం' : 'హిందోళవసంతం',
    'సాళంగ': 'సాళంగం',
    'శుద్దవసంతం': 'శుద్ధవసంతం',
    'దన్నాసి': 'ధన్నాసి',
    'సామవరాశి':'సామవరాళి',
    'వళవంజరం': 'వళ పంజరం',
    'వసంత వరాళి': 'వసంతవరాళి',
    'గేళ' : 'గౌళ',
    'గౌళి':  'గౌళ',
    'మళవిశ్రీ' : 'మాళవశ్రీ',
    'మాళవి శ్రీ' : 'మాళవశ్రీ',
    'మాళవిశ్రీ': 'మాళవశ్రీ',
    'నీలాంబరం' : 'నీలాంబరి',
    'మాళవిఁగౌళ': 'మాళవిగౌళ',
    'మాళవిగౌళి' :'మాళవిగౌళ',
    'మౌళవిగౌళ':'మాళవిగౌళ',
    'నట్ట నారాయణి': 'నట్టినారాయణి',
    'రమక్రియ' : 'రామక్రియ',
    'సామ వరాళి' : 'సామవరాళి',
    'సాళంగ౦' : 'సాళంగం' ,
    'బంగాళం': 'భంగాళం',
    'జౌళిరామక్రియ': 'బౌళిరామక్రియ',
    'పాటి' : 'పాడి',
    'పొడి' : 'పాడి',
    'తొండి' : 'తోడి',
    'తోండి' : 'తోడి',
}

data.Ragam.replace(typo_tbl,inplace=True)

data.drop(['Pallavi'], axis=1, inplace=True)
for i in range(1, 16):
    data.drop([f'Charanam{i}'], axis=1, inplace=True)

data.drop(['Chapter'], axis=1, inplace=True)

data.to_json('annamayya_dataset_cleaned.json')